BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииСМобильнымиУстройствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МониторСинхронизацииСМобильнымиУстройствами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/СпособыСинхронизацииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыСинхронизацииДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияССервисом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменФайлами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ТипыПровайдеровREST.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПровайдеровREST</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Яндекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dropbox</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Google</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ТранспортыОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ТранспортыОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СжиматьФайлИсходящегоСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольАрхиваСообщенияОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйДопустимыйРазмерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяНаРесурсе</Name>
					<Comment>Имя пользователя (логин) на внешнем ресурсе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяНаРесурсе</Name>
					<Comment>Пароль пользователя на внешнем ресурсе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапомнитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMAILУчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользование</Name>
					<Comment>Запретить использование транспорта</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТранспорта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДлиннойСтрокой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииСМобильнымиУстройствами/Forms/Монитор/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантАктивности = "ВсеУстройства";
	
	ПроверитьНачальноеВключениеОбменаДанными();
	
	УстановитьПараметрыСпискаУстройств();
	
	ОбновитьВсеНаСервере();
	
	ОбновитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьОбработчикиОбновления();
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если Настройки["ВариантАктивности"] <> Неопределено Тогда
		ВариантАктивности = Настройки["ВариантАктивности"];
		УстановитьУсловиеАктивностиВСпискеУстройств();
		ОбновитьГруппуСпискаМобильныхУстройств(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненОбменДанными" Тогда
		ОтключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеОбмена");
		ОбновитьВсеНаСервере();
		ПроверитьОбработчикиОбновления(Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СинхронизацияВключенаПриИзменении(Элемент)
	ПереключитьИспользованиеОбменаВКонфигурации(СинхронизацияВключена);
	ОбновитьЭлементыФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьСинхронизацию(Команда)
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Выключить синхронизацию на этом компьютере?'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыключитьСинхронизациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Выключить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
	#КонецОбласти
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьСинхронизациюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СинхронизацияВключена = Ложь;
	ВыключитьСинхронизациюСервер();
	ОбновитьИнтерфейс();
	Оповестить("ИзмененаСинхронизация");
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьСинхронизациюСервер()
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда 
		Константы.ИспользоватьСинхронизациюДанных.Установить(Ложь);
	КонецЕсли;
	
	// Выбор способа устанавливает функциональные опции
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДомашнююСетьПриИзменении(Элемент)
	ПереключитьИспользованиеДомашнейСетиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФайловыйСервисПриИзменении(Элемент)
	ПереключитьИспользованиеФайловогоСервисаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриостановитьСинхронизациюПриИзменении(Элемент)
	
	Если ПриостановитьСинхронизацию Тогда
		АктивныеЗадания = ФоновоеЗаданиеОбмена();
	КонецЕсли;
	
	Если ПриостановитьСинхронизацию И АктивныеЗадания <> Неопределено Тогда
		
		#Область ПоказатьВопрос
		ТекстВопроса = НСтр("ru='Обмен файлами выполняется в данный момент в автоматическом режиме
				|Отменить этот обмен файлами?'");
		
		Оповещение = Новый ОписаниеОповещения("ПодтвердитьПрекращениеОбмена_Завершение", ЭтотОбъект, АктивныеЗадания);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Прекратить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да,);
		#КонецОбласти
		
	Иначе
		ПриостановитьСинхронизациюСервер(Ложь);
		ПроверитьОбработчикиОбновления(Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиТаблицы_СписокУстройств

&НаКлиенте
Процедура СписокУстройствВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуУстройства(Элемент.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокУстройствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	ПоказатьПредупреждение(, НСтр("ru='Добавление мобильных устройств происходит автоматически при первом получении данных от нового устройства'") );
	
КонецПроцедуры


#КонецОбласти 


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьВсеНаСервере();
	ОбновитьЭлементыФормы(ЭтотОбъект);
	ПроверитьОбработчикиОбновления();
КонецПроцедуры


&НаКлиенте
Процедура АвтосинхронизацияВключить(Команда)
	ВключитьАвтоСинхронизациюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура АвтосинхронизацияКакИспользовать(Команда)
	ПоказатьТекстДокументации("АвтоматическаяСинхронизация");
КонецПроцедуры

&НаКлиенте
Процедура ДомашняяСетьКакИспользовать(Команда)
	ПоказатьТекстДокументации("ИспользованиеДомашнейСети");
КонецПроцедуры

&НаКлиенте
Процедура ДомашняяСетьНастройки(Команда)
	ОткрытьНастройкуДомашнейСети();
КонецПроцедуры

&НаКлиенте
Процедура ФайловыйСервисКакИспользовать(Команда)
	ПоказатьТекстДокументации("ИспользованиеОблачногоСервиса");
КонецПроцедуры

&НаКлиенте
Процедура ФайловыйСервисНастройки(Команда)
	ОткрытьНастройкуФайловогоСервиса();
КонецПроцедуры

&НаКлиенте
Процедура ФайловыйСервисСинхронизировать(Команда)
	ОткрытьОбменЧерезОблачногоПровайдера();
КонецПроцедуры

&НаКлиенте
Процедура ВсеУстройства(Команда)
	ВариантАктивности = Команда.Имя;
	УстановитьУсловиеАктивностиВСпискеУстройств();
	ОбновитьГруппуСпискаМобильныхУстройств(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоАктивные(Команда)
	ВариантАктивности = Команда.Имя;
	УстановитьУсловиеАктивностиВСпискеУстройств();
	ОбновитьГруппуСпискаМобильныхУстройств(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтключенные(Команда)
	ВариантАктивности = Команда.Имя;
	УстановитьУсловиеАктивностиВСпискеУстройств();
	ОбновитьГруппуСпискаМобильныхУстройств(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ЗагрузитьДанныеИзфайлаКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеЗаписиКОтправке(Команда)
	ТекущиеДанные = Элементы.СписокУстройств.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПометитьВсеЗаписиКОтправкеНаСервере(ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#Область Обновление_данных

&НаКлиенте
Процедура ПроверитьОбработчикиОбновления(ОбновитьВручную = Ложь)

	Если Не ПриостановитьСинхронизацию Или ОбновитьВручную Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеОбмена", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСостояниеОбмена()
	
	Если Не ВводДоступен() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеОбмена", 1, Истина);
		Возврат;
	КонецЕсли;
	
	ОбновитьСостояниеПроцессов();
	
	Если Не ПриостановитьСинхронизацию Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеОбмена", 10, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Если обмен еще не использовался, включаем его авторматически
&НаСервере
Процедура ПроверитьНачальноеВключениеОбменаДанными()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МобильноеПриложение.Ссылка) КАК Количество
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|ГДЕ
	|	НЕ МобильноеПриложение.ЭтотУзел";
	Выборка = Запрос.Выполнить().Выбрать();
	ПланОбменаИспользуется = Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество);
	
	Если Не СинхронизацияВключена И Не ПланОбменаИспользуется Тогда
		// в плане обмена еще нет ни одного узла - значит вручную обмен не выключали
		ПереключитьИспользованиеОбменаВКонфигурации(Истина);
		СинхронизацияВключена = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеНаСервере()
	
	СинхронизацияВключена = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
	ОбновитьПараметрыДомашнейСети();
	ОбновитьПараметрыОблачногоПровайдера();
	ОбновитьСостояниеПроцессов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаУстройств()
	
	УстановитьУсловиеАктивностиВСпискеУстройств();
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СписокУстройств.Параметры.УстановитьЗначениеПараметра ("КодУспеха", ВсеКоды.Выполнено.Код);
	
	КодыОшибок = Новый Массив;
	Для Каждого ЭлементКода Из ВсеКоды Цикл
		Если ЭлементКода.Значение.ЯвляетсяОшибкой Тогда
			КодыОшибок.Добавить(ЭлементКода.Значение.Код);
		КонецЕсли;
	КонецЦикла;
	СписокУстройств.Параметры.УстановитьЗначениеПараметра ("КодыОшибок", КодыОшибок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловиеАктивностиВСпискеУстройств()
	
	СписокУстройств.Параметры.УстановитьЗначениеПараметра ("Активность", 
			?(ВариантАктивности = "ВсеУстройства", Неопределено, ВариантАктивности = "ТолькоАктивные"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыДомашнейСети()
	
	ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
	ИспользоватьДомашнююСеть = Не ПараметрыДомашняяСеть.ЗапретитьИспользование;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыОблачногоПровайдера()
	
	СвойстваАккаунта = Неопределено;
	ОблачныйПровайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
	ПараметрыОблачногоХранилищаФайлов = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(ОблачныйПровайдер), Истина);
	ПараметрыОблачногоХранилищаФайлов.Вставить("СвойстваАккаунта", СвойстваАккаунта);
	ПараметрыЦентральнойБазы = ОбменМобильноеПриложение.ПараметрыЦентральнойБазыМобильныхПриложений();
	
	ИспользоватьФайловыйСервис = Не ПараметрыОблачногоХранилищаФайлов.ЗапретитьИспользование;
	
	ВидТранспорта = СинхронизацияАвтономныхКопий.ВидТранспортаПоПровайдеру(ОблачныйПровайдер);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеПроцессов()
	
	ПриостановитьСинхронизацию = Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить();
	Элементы.ФайловыйСервисСинхронизировать.Доступность = ПриостановитьСинхронизацию;
	
	Элементы.СписокУстройств.Обновить();

	Если Не ИспользоватьФайловыйСервис Или Не ЗначениеЗаполнено(ВидТранспорта) Тогда
		Элементы.ГруппаСостояниеОбменаСХранилищами.Видимость = Ложь;
	ИначеЕсли Не Элементы.ГруппаСостояниеОбменаСХранилищами.Видимость Тогда
		 Элементы.ГруппаСостояниеОбменаСХранилищами.Видимость = Истина;
	КонецЕсли;
	
	Обработки.МониторСинхронизацииСМобильнымиУстройствами.ОбновитьСостояниеПрцессаНаФорме(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФоновоеЗаданиеОбмена()
	
	Возврат АвтоматОбменаФайлами.ФоновоеЗаданиеОбмена(Истина);
	
КонецФункции


#КонецОбласти


#Область Настройка_элементов_формы


&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыФормы(Форма)
	
	ОбновитьГруппуВключенияСинхронизации(Форма);
	ОбновитьГруппуДомашняяСеть(Форма);
	ОбновитьГруппуФайловыйСервис(Форма);
	ОбновитьГруппуСпискаМобильныхУстройств(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьГруппуВключенияСинхронизации(Форма)
	
	Форма.Элементы.ГруппаВключениеСинхронизации.Видимость = Не Форма.СинхронизацияВключена;
	Форма.Элементы.ГруппаДомашняяСеть.Доступность         = Форма.СинхронизацияВключена;
	Форма.Элементы.ГруппаФайловыйСервис.Доступность       = Форма.СинхронизацияВключена;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьГруппуДомашняяСеть(Форма)
	
	Если Форма.ИспользоватьДомашнююСеть Тогда
		Форма.Элементы.ДомашняСетьКартинка.Доступность = Истина;
		Форма.Элементы.ЗаголовокТранспотраДомашняяСеть.Заголовок = НСтр("ru='Синхронизация в домашней сети включена'");
	Иначе
		Форма.Элементы.ДомашняСетьКартинка.Доступность = Ложь;
		Форма.Элементы.ЗаголовокТранспотраДомашняяСеть.Заголовок = НСтр("ru='Синхронизация в домашней сети отключена'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьГруппуФайловыйСервис(Форма)
	
	ТекстЗаголовка      = "";
	КартинкаПровайдера  = Неопределено;
	Если Форма.ОблачныйПровайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Dropbox") Тогда
		
		КартинкаПровайдера = БиблиотекаКартинок.СинхронизацияDropBox48;
		ТекстЗаголовка = ?(Форма.ИспользоватьФайловыйСервис, 
			НСтр("ru='Обмен файлами через Dropbox включен'") , 
			НСтр("ru='Обмен файлами через Dropbox отключен'"));
			
	ИначеЕсли Форма.ОблачныйПровайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Google") Тогда
		
		КартинкаПровайдера = БиблиотекаКартинок.СинхронизацияGoogleDrive48;
		ТекстЗаголовка = ?(Форма.ИспользоватьФайловыйСервис, 
			НСтр("ru='Обмен файлами через Google Drive включен'") , 
			НСтр("ru='Обмен файлами через Google Drive отключен'"));
			
	ИначеЕсли Форма.ОблачныйПровайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
		
		КартинкаПровайдера = БиблиотекаКартинок.СинхронизацияЯндексДиск48;
		ТекстЗаголовка = ?(Форма.ИспользоватьФайловыйСервис, 
			НСтр("ru='Обмен файлами через Яндекс.Диск включен'") , 
			НСтр("ru='Обмен файлами через Яндекс.Диск отключен'"));
		
	Иначе
		
		КартинкаПровайдера = БиблиотекаКартинок.СинхронизацияКаталог48;
		ТекстЗаголовка = ?(Форма.ИспользоватьФайловыйСервис, 
			НСтр("ru='Обмен файлами через облачное хранилище файлов включен'") , 
			НСтр("ru='Обмен файлами через облачное хранилище файлов отключен'"));
			
	КонецЕсли;
	
	Форма.Элементы.ФайловыйСервисКартинка.Картинка              = КартинкаПровайдера;
	Форма.Элементы.ФайловыйСервисКартинка.Доступность           = Форма.ИспользоватьФайловыйСервис;
	Форма.Элементы.ГруппаАвтообмен.Доступность   = Форма.ИспользоватьФайловыйСервис;
	Форма.Элементы.ЗаголовокТранспотраФайловыйСервис.Заголовок  = ТекстЗаголовка;
	
	// Представление аккаунта
	ПараметрыОблака = Форма.ПараметрыОблачногоХранилищаФайлов;
	Если Не ЗначениеЗаполнено(ПараметрыОблака.СвойстваАккаунта) 
		Или Не ЗначениеЗаполнено(ПараметрыОблака.СвойстваАккаунта.КлючАвторизации) Тогда 
		
		Форма.ЛогинОблачногоХранилищаФайлов = НСтр("ru='Не авторизован'");
		
	Иначе
		
		Если Форма.ПараметрыЦентральнойБазы = Неопределено 
			Или Не ЗначениеЗаполнено(Форма.ПараметрыЦентральнойБазы.ИмяЭтойБазы) Тогда
			ИмяБазы = НСтр("ru='не задано'"); 
		Иначе
			ИмяБазы = Форма.ПараметрыЦентральнойБазы.ИмяЭтойБазы; 
		КонецЕсли;
		 
		Форма.ЛогинОблачногоХранилищаФайлов = СтрШаблон(НСтр("ru='Логин: %1, имя базы: %2'"), 
						ПараметрыОблака.СвойстваАккаунта.ПредставлениеАккаунта, ИмяБазы);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьГруппуСпискаМобильныхУстройств(Форма)
	
	Если Не Форма.ПланОбменаИспользуется Тогда
		Форма.Элементы.ГруппаСписокМобильныхУстройств.ТекущаяСтраница = Форма.Элементы.СтраницаНетУстройств;
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ГруппаСписокМобильныхУстройств.ТекущаяСтраница = Форма.Элементы.СтраницаСписокУстройств;
	
	Форма.Элементы.СписокМобильныхУстройствВсеУстройства1.Пометка     = Форма.ВариантАктивности = "ВсеУстройства";
	Форма.Элементы.СписокМобильныхУстройствТолькоАктивные1.Пометка    = Форма.ВариантАктивности = "ТолькоАктивные";
	Форма.Элементы.СписокМобильныхУстройствТолькоОтключенные1.Пометка = Форма.ВариантАктивности = "ТолькоОтключенные";
	
КонецПроцедуры



#КонецОбласти 


&НаСервереБезКонтекста
Процедура ПереключитьИспользованиеОбменаВКонфигурации(ИспользоватьОбмен)

	Константы.ИспользоватьСинхронизациюДанных.Установить(ИспользоватьОбмен);
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(
		?(ИспользоватьОбмен, Перечисления.СпособыСинхронизацииДанных.ОбменФайлами, 
				Перечисления.СпособыСинхронизацииДанных.НеИспользовать)
		);

КонецПроцедуры

&НаСервере
Процедура ПереключитьИспользованиеДомашнейСетиНаСервере()
	
	СсылкаТрансопорта = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети();
	ОбъектТранспорта = СсылкаТрансопорта.ПолучитьОбъект();
	ОбъектТранспорта.ЗапретитьИспользование = Не ИспользоватьДомашнююСеть;
	ОбъектТранспорта.Записать();
	ОбновитьГруппуДомашняяСеть(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьИспользованиеФайловогоСервисаНаСервере()
	
	Если ЗначениеЗаполнено(ОблачныйПровайдер) Тогда
		СсылкаТрансопорта = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(ОблачныйПровайдер);
		ОбъектТранспорта = СсылкаТрансопорта.ПолучитьОбъект();
		ОбъектТранспорта.ЗапретитьИспользование = Не ИспользоватьДомашнююСеть;
		ОбъектТранспорта.Записать();
		ОбновитьГруппуФайловыйСервис(ЭтотОбъект);
		ОбновитьСостояниеПроцессов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПрекращениеОбмена_Завершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ПриостановитьСинхронизацию = Ложь;
	Иначе
		ПриостановитьСинхронизациюСервер(Истина, ДополнительныеПараметры);
	КонецЕсли;
	
	ПроверитьОбработчикиОбновления(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриостановитьСинхронизациюСервер(ПрекращатьФоновоеЗадание, АктивноеЗадание = Неопределено)
	
	Если ПрекращатьФоновоеЗадание Тогда
		Если АктивноеЗадание = Неопределено Тогда
			АктивноеЗадание = ФоновоеЗаданиеОбмена();
			Если АктивноеЗадание = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(АктивноеЗадание.ИдентификаторФоновогоЗадания);
		
		СостояниеОбмена = АвтоматОбменаФайлами.СостояниеОбмена(ВидТранспорта);
		АвтоматОбменаФайлами.СброситьСостояние(СостояниеОбмена);
		
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.ОбменФайламиСМобильными, 
			Не ПриостановитьСинхронизацию);
	
	Константы.ДеньгиПриостановитьАвтосинхронизацию.Установить(ПриостановитьСинхронизацию);
	Элементы.ФайловыйСервисСинхронизировать.Доступность = ПриостановитьСинхронизацию;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуДомашнейСети()
	
	Оповещение = Новый ОписаниеОповещения("НастройкаТранспортаЗавершение", ЭтотОбъект, "ДомашняяСеть");
	ОткрытьФорму("Обработка.МониторСинхронизацииСМобильнымиУстройствами.Форма.НастройкаДомашнейСети",
			, ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуФайловогоСервиса()
	
	Оповещение = Новый ОписаниеОповещения("НастройкаТранспортаЗавершение", ЭтотОбъект, "ФайловыйСервис");
	ОткрытьФорму("Обработка.МониторСинхронизацииСМобильнымиУстройствами.Форма.НастройкаОблачногоСервиса",
			, ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаТранспортаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПриИзмененииНастроекТранспортаНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНастроекТранспортаНаСервере(ВидТранспорта = "")
	
	Если ВидТранспорта = "" Или ВидТранспорта = "ДомашняяСеть" Тогда
		ОбновитьПараметрыДомашнейСети();
		ОбновитьГруппуДомашняяСеть(ЭтотОбъект);
	КонецЕсли;
	
	Если ВидТранспорта = "" Или ВидТранспорта = "ФайловыйСервис" Тогда
		ОбновитьПараметрыОблачногоПровайдера();
		ОбновитьГруппуФайловыйСервис(ЭтотОбъект);
	КонецЕсли;
	
	ОбновитьСостояниеПроцессов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекстДокументации(ИмяФормы)

	ИмяИнструкции = "Обработка.МониторСинхронизацииСМобильнымиУстройствами" 
			+ ?(ЗначениеЗаполнено(ИмяФормы), ".Форма." + ИмяФормы, "");
	
	Если Не ОткрытьСправку(ИмяИнструкции) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Извините, эта справка отсутствует в текущей версии программы'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУстройства(Устройство)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Устройство);
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуУстройстваЗавершение", ЭтотОбъект, Устройство);
	ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ПросмотрУзла", ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуУстройстваЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокУстройств.Обновить();
	
КонецПроцедуры


// Ручной обмен файлами

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаКлиент()
	
	ОчиститьСообщения();
	
	Если НЕ СинхронизацияВключена Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ТранспортФайлДоступен() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Чтение файла в данный момент недоступно. Возможно, не завершилось предыдущее чтение в этом или в другом сеансе'"));
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = ИмяФайлаЗагрузки;
	Диалог.Заголовок = НСтр("ru = 'Выберите файл с мобильными данными для загрузки'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	Фильтр = НСтр("ru = 'Файлы сообщений'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	Фильтр = Фильтр + " (*.xml)|*.xml";
	Диалог.Фильтр = Фильтр;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Если НЕ Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяФайлаЗагрузки = Диалог.ВыбранныеФайлы[0];
	Отказ = Ложь;
	ОписаниеПроблемы = "";
	ИмяФайлаОтвета = "";
	ВыполнитьОбменФайламиСервер(ИмяФайлаЗагрузки, Отказ, ОписаниеПроблемы, ИмяФайлаОтвета);
	
	Если ЗначениеЗаполнено(ОписаниеПроблемы) Тогда
		Сообщить(ОписаниеПроблемы);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ЗначениеЗаполнено(ОписаниеПроблемы) Тогда
			ТекстСообщения = НСтр("ru = 'При загрузке или выгрузке данных возникли проблемы .
				|Ответный файл <%1> готов к передаче на мобильное устройство'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Данные с мобильного устройства обработаны успешно.
				|Переместите на мобильное устройство файл <%1> и выполните там загрузку данных'");
		КонецЕсли;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ИмяФайлаОтвета);
		ПоказатьПредупреждение(,ТекстСообщения);
	КонецЕсли; 
	
	ОбновитьВсеНаСервере();
	ОбновитьЭлементыФормы(ЭтотОбъект);
	ПроверитьОбработчикиОбновления();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменФайламиСервер(ИмяФайла, Отказ, ОписаниеПроблемы, ИмяФайлаОтвета)
	
	ПроцессыОбменаСлужебный.ВыполнитьОбменВРежимеРучногоОбменаФайлами(ИмяФайла, Отказ, ОписаниеПроблемы, ИмяФайлаОтвета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТранспортФайлДоступен()

	ТранспортФайл = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортКаталога();
	Попытка
		ЗаблокироватьДанныеДляРедактирования(ТранспортФайл);
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	РазблокироватьДанныеДляРедактирования(ТранспортФайл);
	Возврат Истина;

КонецФункции


// Обмен через облачного провайдера

&НаКлиенте
Процедура ОткрытьОбменЧерезОблачногоПровайдера()
	
	// Параметры открываемой формы
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Провайдер", ОблачныйПровайдер);
	
	// Обработчик оповещения о закрытии формы
	Оповещение = Новый ОписаниеОповещения("ОбменЧерезОблачногоПровайдераЗавершение", ЭтотОбъект);
	
	// Открытие формы
	ОткрытьФорму("Обработка.МониторСинхронизацииСМобильнымиУстройствами.Форма.ИнтерактивныйОбменЧерезСервис", 
				ПараметрыФормы, ЭтотОбъект, Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменЧерезОблачногоПровайдераЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьГруппуСпискаМобильныхУстройств(ЭтотОбъект);
	
КонецПроцедуры



#Область Переход_на_автосинхронизацию


&НаКлиенте
Процедура ВключитьАвтоСинхронизациюКлиент()
	
	Если СинхронизацияВключена Тогда
		
		#Область ПоказатьВопрос
		ТекстВопроса = НСтр("ru='Использовать автоматическую синхронизацию через облачный сервис вместо обмена файлами?
		|Обратите внимание: услуги облачного сервиса предоставляются по подписке на платной основе'");
		
		ДополнительныеПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ВключитьАвтоСинхронизациюКлиентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
		#КонецОбласти
		
	Иначе
		
		ВключитьАвтосинхронизацию(Истина);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьАвтоСинхронизациюКлиентЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьАвтосинхронизацию(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьАвтосинхронизацию(ОткрыватьМонитор = Ложь)
	
	ВключитьАвтосинхронизациюСервер();
	Оповестить("ИзмененаСинхронизация");
	ОбновитьИнтерфейс();
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
	Если ОткрыватьМонитор Тогда
		ОткрытьФорму("ОбщаяФорма.УправлениеСервисомАвтосинхронизации");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВключитьАвтосинхронизациюСервер()
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда 
		Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
	КонецЕсли;
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.СинхронизацияССервисом);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПометитьВсеЗаписиКОтправкеНаСервере(Устройство)

	Если Не ЗначениеЗаполнено(Устройство) Тогда
		Возврат;
	КонецЕсли;
	ПланыОбмена.ЗарегистрироватьИзменения(Устройство);
	
КонецПроцедуры


#КонецОбласти


#КонецОбласти
